{"discountTypeData":["Good Food and Drinks","Culinary Savior","Clothing and Accessories","Home Decor","Painting and Design","Flowers and Plants","Travel and Accommodation"],"divider":{"allSaying":"Collection of Quotes","allSayingPlace":"Qingdian Platform","book":"Youth Masterpiece","create":"Creative Small Items","dictionary":"Youth Dictionary","firstSong":"First Song of Guangnv","history":"Qingdian History","host":"Host Introduction","listeningGuide":"Listening Guide","memoryCeremony":"Memorial Service","method":"Participate in Maxin","onlineDiscount":"Online Discounts","onSiteDiscount":"On-site Discounts","otherDonation":"Other Ways to Donate","phyTestTitle":"Psychological Test"},"donationData":["Join as a Member","Taiwan Friends Please Enter","Overseas Friends Please Enter","900866569"],"dotBookData":[{"title":"Setting Out for Youth: Mark and Mary's European Travel Diary","description":"Decided on a travel destination based on just one online photo, paying tribute to 'The Secret Life of Walter Mitty'. A whimsical journey for the youth workers, with a lone man and woman traveling through Vienna, Prague, Nuremberg, Munich, Hallstatt, and other unplanned adventures."},{"title":"Dear Mark and Mary: Is Every Man Like This?","description":"Based on the true experiences of fans from the Qingdian teachings over 6000 days, combining Mark's divine insights and Mary's dark humor illustrations. 30 letters to those who always suffer in love, unknowingly understanding something, and naturally attracting true love."}],"dotCreateData":[{"title":"Mark Calendar 2022","description":"Use the Mark Calendar to let everyone lie flat in hell together. This calendar is not for yourself, place it at the highest point in the office so people have to look at it. Tilt the calendar 45 degrees outward to let the real malice radiate from you. After buying a calendar for daily improvement, you need the dark Mark Calendar to balance it."},{"title":"Mark Calendar 2023","description":"Atomic Habits says that if you improve 1% every day, you will grow by 3700% in a year! The problem is, where do we start, and how do we consciously make changes? Let the Mark Calendar remind you daily, so you don't lose the race like the rabbit in the tortoise and the hare."},{"title":"Mark and Mary X Triple.Cell","description":"Did you listen to Mark's Mailbox today? Use the 16 stickers of the master and mistress to dominate Line groups, becoming one of the 24 unfilial children and the best at rejecting others."}],"dotDictionary01":{"description":"Abbreviation for Mark's Mailbox","title":"Maxin"},"dotDictionary02":{"description":"Listeners of Youth Point","title":"Friends"},"dotDictionary03":{"description":"Female voice of Mark","title":"Ou Xiaorou"},"dotDictionary04":{"description":"Bail fee for Mark","title":"Bail Fund"},"dotDictionary05":{"description":"Anniversary Memorial Service for the end of Youth Point program","title":"Memorial Service"},"dotDictionary06":{"description":"A new term created by Mary, describing an old person with a childish soul","title":"Childish Soul"},"dotDictionary07":{"description":"Book title 'Setting Out for Youth: Mark and Mary's European Travel Diary'","title":"European Travel Diary"},"dotDictionary08":{"description":"Mary, single for a long time, was crowned 'Ambassador of Singleness' and 'Chinese Single Woman' on the show","title":"Chinese Single Woman"},"dotDictionary09":{"description":"Support the poor DJs, you can include money in the letter for Mark and Mary. It's not mandatory, but it will make the master and mistress very happy if you do.","title":"Donate"},"dotHistory":{"20131214":"Held the 'Mental Damage Concert' at Ximen Riverbank, the first ticketed event with listeners, and Mark's first semi-face reveal.","20140802":"Held the 'Mark and Mary Talk Show' at New Taipei City Hall, tickets sold out quickly, and invited listeners to demonstrate the seven-minute science on-site.","20150810":"Published the new book 'Setting Out for Youth: Mark and Mary's European Travel Diary', recording their European trip, and held a book signing event at the station front bookstore.","20160123":"Held the 'Create Your Own Youth Group' event at Taipei Main Station, based on the 16 personality types theory, but no successful pairings.","20161120":"Held the movie 'Intestinal Rush Party' gathering.","20170307":"The program was discontinued, and hundreds of listeners gathered outside the UFO radio station that night for an on-site graduation ceremony.","20171229":"The first 'Handsome World Cup' started, Taiwanese star Takeshi Kaneshiro won the championship.","20180318":"Held the first anniversary memorial service for the end of Youth Point at Huabo Park, presenting the enthronement ceremony, underage advocacy, and live version of Mark's Mailbox.","20180519":"Mark participated in the comedy stage play 'The Dictator's Movie Dream'.","20181106":"To support the same-sex referendum and balance anti-gay advertisements, Mark and Mary launched a crowdfunding project on Zeczec for radio ad placement, raising 12 times the target amount.","20181125":"Held a pre-will workshop, inviting professional lawyers to teach how to make a pre-will, and donated all proceeds to charity.","20190331":"Held the second anniversary memorial service for the end of Youth Point at Huabo Fashion Hall, inviting friends to bring unwanted old clothes and accessories for FashionDay. The on-site aristocrats decided to group by zodiac signs, but due to lack of time, no winner was chosen.","20190720":"The YouTube channel 'LWW Listening While Working' reached 30,000 subscribers.","20190909":"The YouTube channel 'LWW Listening While Working' officially launched memberships.","20200427":"The last week of April, the YouTube channel 'LWW Listening While Working' updated daily, this week was called 'Maxin Week' or 'One Week of Mark Four' by listeners.","20201018":"The TV drama 'Sunshine Radio Never Closes', based on the well-known radio hosts Mark and Mary, premiered on PTS.","20201122":"Held the third anniversary memorial service for the end of Youth Point at Huabo Fashion Hall.","20201202":"Spotify announced the 2020 streaming rankings, and Mark's Mailbox Dear Marcy ranked 5th on the Podcast chart.","20210307":"The fourth anniversary of the end of Youth Point.","20210705":"The second 'Handsome World Cup' started, Chinese star Song Weilong won the championship.","20210718":"Mark's Mailbox participated in the KKBOX music festival, hosting a live mailbox session.","20211015":"Global friends collaborated to display a three-day light wall advertisement at MRT City Hall Station.","20211110":"AnyMind Group cooperated with Mark and Mary to launch the 2022 Mark Calendar.","20220105":"The YouTube channel 'LWW Listening While Working' reached 100,000 subscribers.","20220122":"Tickets for the 2022 Youth Point Memorial Service sold out instantly, setting a record for TICC event ticket sales.","20220201":"Mark and Mary, along with heavyweight seniors, launched a new project 'Star Hunter'.","20220320":"Held the fifth anniversary memorial service for the end of Youth Point at TICC Taipei International Convention Center.","20220702":"Mark's Mailbox 2.0 Hsinchu Dayuan Department Store Special Edition.","20220917":"'Youth Point Qingdian Church Tour Inspiration Conference' was held in Kaohsiung, finally crossing the Zhuoshui River.","20220930":"Compiled many letters from Mark's Mailbox and published the second masterpiece 'Dear Mark and Mary: Is Every Man Like This?'.","20221001":"Launched the crowdfunding project for the 2023 Mark Calendar on Zeczec, hoping buyers will become rabbits that won't lose the race against the tortoise.","20221201":"The 2023 Mark Calendar crowdfunding project ended, raising a total of 2,894,764 NTD, six times the target amount.","20230119":"The program 'Brother Sister Interesting' will be renamed and the broadcast time will be adjusted to 1 PM."},"dotProductItem":{"publish":"Publish"},"dotSayingData":[{"title":"You are awesome!","description":"Mark's classic line, listeners often write in asking Mark to say this, it not only encourages oneself but also boosts morale and mood!"},{"title":"You are not a failure, just not chosen.","description":"Mary said she was hit by this sentence, but Mark said failure is failure. A sentence can be interpreted in many ways, but just find the interpretation you like."},{"title":"Understand how to make yourself progress and get better, not just follow blindly.","description":"For everything, before deciding to do something, understand the rules of the game and how to improve yourself, instead of blindly following others."},{"title":"When you want to do something, the whole universe will help you.","description":"This is the 'Law of Attraction', using positive thoughts to bring about positive results."},{"title":"The more mature a person is, the more they know to humbly stick to the basics.","description":"By sticking to the basics, you can lay a foundation for continuous progress. If experience makes you arrogant, it will be the start of risky behavior."},{"title":"The real strong person is the one who can play a bad hand well.","description":"Everyone is dealt different hands in life, even if you are dealt a bad hand, you can play it well."},{"title":"Don't have the first date at 'home'.","description":"For the first meeting, since both parties are unfamiliar, try to meet in a public place to ensure safety."},{"title":"Don't ask 'why'.","description":"This sentence appears in many episodes of 'Mark's Mailbox'. The letter writer wonders why the other person chose someone else, broke up with them, or if they are not good enough. But asking 'why' can sometimes lead to despair."},{"title":"Don't guess others' thoughts.","description":"We often guess others' thoughts based on their actions or words, but we are not the person involved. Such speculation only brings more worries and troubles."},{"title":"Don't let age be a pressure. At any age, you can do what you want, except maybe having children due to biological limitations.","description":"Many letter writers ask, 'I am already... years old, is it okay to make this decision?' Mark's words give those hesitant people one less excuse."},{"title":"'Vanity' and 'glory' can be mixed to some extent, but both can become pathological if taken too far.","description":"The letter writer pursues sexual pleasure to satisfy vanity, but Mark and Mary point out that such behavior can lead to emptiness and inferiority."},{"title":"No matter which path you choose, the important thing is not to hesitate after choosing. Don't waste time being indecisive.","description":"Once you choose, whether good or bad, you have to walk it bravely."},{"title":"The most important thing is to be yourself, don't change yourself to please others.","description":"Some letter writers mention that they adapt to others' preferences to get closer to them. Mark believes that instead of pretending to understand and please, it's better to honestly express your willingness to learn to get closer."},{"title":"You deserve to have beautiful things.","description":"If the thought 'I don't deserve this' suddenly comes to mind, recognize that it's just an illusion."},{"title":"Life is like a 'tire', constantly rolling forward. Sometimes you feel like you are far behind, but you are actually moving forward.","description":"Remember to often talk to yourself when facing difficulties, and also speak out loud. This output helps you understand what you are thinking."},{"title":"Don't force yourself to eat trash.","description":"Some letter writers ask for Mark and Mary's opinion: 'Should I force myself to fit in with someone who doesn't respect me?' Mary thinks forcing yourself to fit in with such a person is like forcing yourself to eat trash."},{"title":"You are the reason for all the flourishing flowers.","description":"You are amazing~"},{"title":"If you are someone who really wants to celebrate your birthday, you can take the initiative to invite people. Don't wait for others to remember your birthday, you can plan a happy day for yourself.","description":"You can be the one who loves yourself the most, don't pretend not to care."},{"title":"Wishes should be something you can achieve yourself. If it depends on another person, you are entrusting yourself to uncertainty, which will make you sadder.","description":"The master's most advocated concept of 'certainty'."},{"title":"Take care of yourself.","description":"Don't always cater to others, remember to prioritize yourself and take care of yourself."},{"title":"Silent protest is not a protest, silence is just silence.","description":"The words that are not spoken are not heard. Being angry inside is useless, only speaking out can defend your rights."},{"title":"If love has a unit, it should be time.","description":"Time is precious and should only be given to precious people."},{"title":"You wouldn't want a water heater that is sometimes hot and sometimes cold, so why be with someone who is inconsistent?","description":"Mary's perfect analogy."}],"footer":["Mark's Mailbox Dear Marcy","©Marcy. All rights reserved."],"good":"Praised by Netizens","hostIntroData":[{"name":"Master Ou Mark","intro":["Real name Shen Ziyu, born on 1982/11/22, graduated from National Chengchi University (Eastern Harvard) Department of Diplomacy.","Leg length is 112 cm, an unpredictable emotional high person, palm length 24 cm, likes big knees.","Joined UFO radio as a DJ at the age of 18, making him the youngest DJ at the station at the time.","Looks similar to Wen Ding Zeng, Kuwabara from Yu Yu Hakusho, and Kazutoyo Koyabu.","Liked Watermelon Sister when he was young, and collected many Lee Sinjie merchandise.","In 2015, he appeared as a special guest on the Podcast 'Youth Wasting Time', saying that if his girlfriend and Mary fell into the water at the same time, he would not save Mary.","On 2018/03/21, on his wife's birthday, he registered their marriage at Da'an Household Registration Office.","In 2022, he founded the self-growth brand 'Sound Art', hoping to use the art of sound to help people reach where they want to go."]},{"name":"Mistress Wu Mary","intro":["Real name Wu Yimei, born on 1984/07/19, graduated from Fu Jen Catholic University Department of Image Communication.","Nicknamed 'Chinese Single Woman' and 'Goddess of Broadcasting'.","Joined UFO Radio as a DJ through a selection in 2004, currently active in column writing, variety shows, online live broadcasts, and event hosting.","Currently a regular on TTV's variety show 'Three Kingdoms Intelligence', forming an on-screen CP with Zhang Litong.","On 2015/11/11, the single 'Things Are Not What You Think' crowdfunded project sold out instantly."]}],"keyInBadMood":"Enter your troubles","listeningGuide":{"crazy":"Click to go to the craziest Podcast list"},"listeningGuideData":[{"title":"Recommended Listening Time","description":"Recommended: sweeping, mopping, cooking, late-night designing and drawing. Not recommended: conservative family gatherings, conservative work environments, children's bedtime stories.","button":"Mark says reading letters is for the screams!"},{"title":"Mark's English Classroom","description":"Because Mark's English is very good, Mary sometimes asks him English questions during the show. You can learn English while listening.","button":"The key to learning English well is?"},{"title":"No episode is not funny","description":"Loyal listeners say: 'Be careful of laughing too hard while exercising', 'Need to hold back sudden laughter when listening alone in public'.","button":"This episode is very (h-e-n) funny!"},{"title":"Listen with headphones","description":"Because the range of letters is broad and everyone's listening tolerance is different, plus Mark's unpredictable emotional highs, it is recommended to listen with headphones to avoid social death.","button":"Listeners misunderstood?!"}],"marcyMailBox":"Mark's Mailbox","marySongData":{"description":"Known as the Ambassador of Singleness, Mistress Wu Mary released this cynical single on the evil Qixi Festival, co-written with Master Mark, composed by the lead singer of Cosmos. Although not a professional singer, she has sung everyone's feelings!","id":"P7eWIidHWvI","title":"Mary 'Things Are Not What You Think'"},"memorialData":[{"title":"Youth Point Graduation Ceremony","description":"On March 7, 2017, loyal listeners never expected the ten-year-long program to end. Those fantastic memories were filled with many fun and funny moments. The youthful nonsense ultimately ended in a melancholy mood, still grateful for turning on the radio back then, it was truly wonderful for ten years."},{"title":"First Anniversary Memorial Service","description":"On March 18, 2018, the first anniversary memorial service for the end of Youth Point was held at Huabo Park. Mark specially hired a recording team to successfully document and present the enthronement ceremony, underage advocacy, and live version of Mark's Mailbox. Non-fans might think the Qingdian Church is an evil money-making organization, but it is full of love and care."},{"title":"Third Anniversary Memorial Service","description":"On March 7, 2020, in response to epidemic prevention, the third anniversary memorial service was changed to an online live broadcast to avoid large indoor gatherings. On that day, Mark and Mary read letters while eating sushi. Mark, despite the lack of background music, could easily control the chat and reading rhythm. Mark loudly roared when the salmon was gone, and Mary showed her love for Nisshin fish."},{"title":"Fourth Anniversary Memorial Service","description":"On March 7, 2021, the live version of Youth Point Memorial Service successfully returned. To avoid the recurrence of the 0.38 incident, applause and cheers were given to those who went to the restroom during the event. Even though Mark was inexplicably sued, he was not defeated, thanks to Penny Chang for assisting in making the video subtitles, where 'bye bye' was misspelled as 'bey bey'."},{"title":"Fifth Anniversary Memorial Service (Part 1)","description":"On March 22, 2022, Mark handed over the fifth anniversary memorial service to a professional team for the first time. Tickets sold out in 50 seconds, and Mark said he would brag about it for life. That day, a group of men who met Mary's criteria bravely took the stage."},{"title":"Fifth Anniversary Memorial Service (Part 2)","description":""}],"method":{"letter":{"address":"Please send to: Mark's Mailbox, 25F, No. 102, Sec. 2, Roosevelt Rd., Taipei 100404, Taiwan","title":"How to send a letter to Mark's Mailbox","warning":["Don't put banknotes near the envelope opening, it may damage the money when Mark and Mary open the letter.","If you want a reply, remember to include a return envelope and postage.","Domestic letter postage is currently 8 NTD, postcard postage is 5 NTD. Remember to include sufficient postage to avoid being returned by the postman."]},"picture":{"address":"Please send to barleyorange@yahoo.com.tw","title":"Cover Photo Submission","warning":["Feel free to submit two or three photos of the same series at once to let the photos rotate.","Title your email 'Mark's Mailbox Cover Photo Submission'."]}},"navItemInfo":[{"title":"About Qingdian Church","pathname":"/about"},{"title":"Evangelical Action","pathname":"/action"},{"title":"Master and Mistress Say","pathname":"/saying"},{"title":"Save the Poor Mailbox","pathname":"/donation"},{"title":"Youth Game Room","pathname":"/game"},{"title":"Youth Whisper","pathname":"/secret"},{"title":"Qingdian Discount Library","pathname":"/discount"}],"onlineDiscountData":[{"type":"Good Food and Drinks","title":"Xuan Zhu SYUANDREW","service":"Self-roasted coffee beans and homemade tea, spice series spreads","method":"Use the discount code 'MARCY' on the official website for an exclusive surprise for friends."},{"type":"Culinary Savior","title":"AWEI Homemade Bakery","service":"European soft bread and handmade coffee beans roasted in clay pots","method":"Send a private message stating 'I am a friend' for exclusive offers."},{"type":"Culinary Savior","title":"Lin Zhen Kuei Hang","service":"Radish cake","method":"Use the discount code 'Qingdian Church' on the official website for a 15% discount."},{"type":"Culinary Savior","title":"Donba Handmade Egg Rolls","service":"Reservation-only handmade egg rolls","method":"Send a private message stating 'I am a friend' for a buy ten get one free offer."},{"type":"Culinary Savior","title":"Ganteng Delicious Curry","service":"Chicken leg steak, four-god soup, oil rice, red meat soup and other various frozen ready-to-eat packages","method":"Note 'Long live the master and mistress' on the order for a free clear pig's trotter soup (worth 160 NTD)."},{"type":"Culinary Savior","title":"Grandpa's Champion Rice","service":"Vacuum-packed champion rice produced and sold by small farmers, free shipping for 9 bags, group purchase available","method":"Send a private message stating 'I am a friend' for exclusive offers."},{"type":"Clothing and Accessories","title":"Artisan Leather Handicraft Studio","service":"Leather handicraft hardware parts and tools","method":"Note 'I am a friend/childish soul is immortal/filtered water/Guangsha Festival/I am a horse fan' on the order for exclusive offers."},{"type":"Clothing and Accessories","title":"European Light Jewelry","service":"European light jewelry, 925 sterling silver and 14K gold","method":"Note 'I am a friend' on the order for exclusive offers."},{"type":"Clothing and Accessories","title":"Daphnis Perfume and Beauty Materials","service":"Boutique perfumes and professional beauty and hairdressing supplies","method":"Enter the exclusive offer store on Shopee for exclusive offers."},{"type":"Clothing and Accessories","title":"WooSox","service":"Various long and short socks made in Taiwan","method":"Use the Shopee discount code 'WOOSMKMB' for a 23% discount."},{"type":"Clothing and Accessories","title":"Accessories by Leaf","service":"Handmade real flower accessories, earrings, hair clips, hair ties, rings","method":"Send a private message or recognize at the market stating 'I am a friend' for a discount or small gift."},{"type":"Home Decor","title":"Triangle Woodwork Studio","service":"Forest bottles and customized forest bottles, also offering online (offline) experience courses","method":"Use the discount code 'marcy2107' for a 10% discount."},{"type":"Home Decor","title":"Only Ferns Home Decor","service":"Glass cups, trays, fruit forks, pillows, table mats and other home decor items","method":"Use the discount code 'FM921' for a 20% discount."},{"type":"Home Decor","title":"Ander Home Products","service":"Kitchen waste machine, vacuum and mop combo, robotic vacuum cleaner and other home cleaning equipment","method":"Send a private message stating 'I am a friend' for exclusive offers."},{"type":"Home Decor","title":"Dachun Society","service":"Japanese tableware","method":"Send a private message stating 'I am a friend' for exclusive offers."},{"type":"Painting and Design","title":"Ooh～yes！","service":"Portrait creation and postcard/business card/poster design services","method":"Send a private message stating 'I am a friend' for a 100 NTD discount."},{"type":"Painting and Design","title":"Kojimaland","service":"Pet and portrait drawings and customized embroidered pet scarves","method":"Send a private message stating 'I am a friend' for exclusive offers."},{"type":"Painting and Design","title":"NiCONiCO_Design","service":"Graphic design (logo, poster, business card, DM, etc.), brand planning, social media graphic design","method":"Send a private message stating 'I am a friend' for exclusive offers."},{"type":"Painting and Design","title":"JH Xu Hand Drawn","service":"Portrait sketches, portraits and portrait illustrations (digital files)","method":"Send a private message stating 'I am a friend' for a 50 NTD discount."},{"type":"Painting and Design","title":"G Dian","service":"Colored pencil, watercolor and digital portrait services","method":"Send a private message stating 'I am a friend' for free shipping."},{"type":"Flowers and Plants","title":"Adorer Design","service":"Handmade ribbon everlasting flowers and various types of aroma stones","method":"Note 'Qingdian Church Disciple' on the order for an exclusive gift."},{"type":"Flowers and Plants","title":"Jiuhui Floral Art","service":"Various customized fresh flower bouquets, flower arrangements, potted plants, wedding bouquets, bridal headpieces, and floral courses","method":"None, offers free delivery service in specific areas of Taipei and New Taipei for orders over 2500 NTD."}],"onSiteDiscountData":[{"type":"Good Food and Drinks","title":"Choice Gelato","service":"Italian handmade ice cream, seasonal fruit and special flavors available irregularly","method":"Visit the store and mention 'I am a friend' for a discount or complimentary drink.","address":"No. 2, Lane 5, Alley 152, Sec. 2, Minquan East Rd., Zhongshan Dist., Taipei City"},{"type":"Good Food and Drinks","title":"Cai. Times","service":"Italian ice cream and various cocktails, different flavors every week, please check the official page for updates","method":"Visit the store and mention 'I am a friend' for a discount.","address":"No. 38, Lane 190, Sec. 1, Dunhua South Rd., Da'an Dist., Taipei City"},{"type":"Good Food and Drinks","title":"2730 Coffee","service":"Delicious cakes, light meals, and coffee drinks, also selling vintage items and accessories","method":"Passcode: I am a friend, will receive a delicious snack.","address":"No. 288, Yanji St., Da'an Dist., Taipei City"},{"type":"Good Food and Drinks","title":"Good French Pastry","service":"Reservation-only pastries/baking courses, only takeout during the pandemic, reservations open at 8 PM every Wednesday","method":"Note 'I am a friend' on the order for an exclusive pastry.","address":"1F, No. 30, Lane 38, Chongde St., Xinyi Dist., Taipei City"},{"type":"Good Food and Drinks","title":"Ganbu Beijing BBQ","service":"A la carte BBQ, Korean/Japanese BBQ specialty","method":"Visit the store and mention 'I am a friend' for member discounts.","address":"No. 32, Guangrong Rd., Luzhou Dist., New Taipei City"},{"type":"Good Food and Drinks","title":"Deep Cup Wine Concept Store","service":"Various special Spanish wines, light meals with olive oil","method":"Visit the store and mention 'I am a friend' for a free glass of wine.","address":"No. 69, Lane 39, Sec. 1, Shipai Rd., Beitou Dist., Taipei City"},{"type":"Clothing and Accessories","title":"In House Good Things Nail Salon","service":"Crystal nails","method":"Make a reservation and mention 'I am a friend' for an exclusive gift.","address":"No. 9-5, Lane 250, Sec. 5, Nanjing East Rd., Songshan Dist., Taipei City"},{"type":"Travel and Accommodation","title":"Blue Sky Garden","service":"Guesthouse","method":"Send a private message on FB stating 'I am a friend' for a sweet price.","address":"No. 58, Qianchuo, Jinning Township, Kinmen County"}],"otherDonation":"If you don't want to donate monthly to the master and mistress, you can express your gratitude through Super Thanks in specific episodes, and you can also edit a thank you message.","pageOpeningData":{"about":["Mark's Mailbox is the successor to the Taiwanese radio program Youth Point, which first aired on UFO Radio (FM92.1) on October 17, 2004. On January 23, 2007, a midnight show was added from Tuesday to Saturday, in addition to the original Sunday block show. Since its debut, it has been popular among students, with many office workers and night owls as listeners.","The last episode of Youth Point aired in 2017. On March 5, 2018, Ou Mark and Mary co-hosted the show 'Brother Sister Interesting' again. Since there were still letters unread, Mark continued Youth Point's 'Mark's Mailbox' and transformed it into the Podcast show 'Mark's Mailbox (DearMarcy)' and the YouTube channel 'LWW Listening While Working' co-hosted with Mary, updating every Monday and Thursday at 11 AM (10 minutes on Monday, 60 minutes on Thursday). The show will continue to air until all letters are read, but the inbox is continuously flooded with enthusiastic letters from listeners, and the day of reading them all is far away."],"action":["After the end of Youth Point, Master Mark and Mistress Mary continue to work hard to promote the teachings of Qingdian Church, hoping to gradually expand the Qingdian universe and bring the light of wisdom to everyone. Here are the details of the master and mistress's efforts to spread the teachings of Qingdian Church."],"discount":["To gradually expand the Qingdian universe, friends from various industries have each provided amazing discounts. This is not only an online discount code distribution center but also a Qingdian discount universe for on-site recognition with friends. Welcome everyone to keep the money in friends' pockets!"],"donation":["Do you still remember the bell and Pavlov's dog? When the bell rings, you must donate to the master and mistress. Whether it's the Bail Fund or Mary's Breast Augmentation Fund, everyone's efforts are needed. Support Youth Point, so our youthful dream can go further and smoother."],"game":["Collect interesting games heard in Mark's Mailbox, share happiness and love. The most famous one is the psychological test shared by Sister Sparrow, which includes six psychological tests. First, draw other illustrations based on the shape in the middle of the canvas, then write two adjectives based on your drawing, and click the 'Check Answer' button to see the answer."],"home":["In 2004, Youth Point first aired on UFO Radio and has been popular among students since its debut. The last episode aired on March 7, 2017, after which host Ou Mark continued it as a Podcast.","Mark's Mailbox DearMarcy","and YouTube","LWW Listening While Working","co-hosted with Mary, updating every Monday and Thursday at 11 AM."],"saying":["Mark's Mailbox does not discuss in advance, does not read letters beforehand, and does not talk about details and processes after the show. During the recording process, they continuously give listeners life advice and ideas, allowing us to see many different lives and become a certain degree of input."],"secret":["Everyone has troubles that are hard to say out loud. If you need to, please place your troubles here and let them slowly disappear."]},"phyTestTopic":["What kind of person are you","What type of opposite sex do you like","What type of job do you like","What type of sex do you like","What is your current lifestyle","What kind of life do you hope for in the future"],"psyTest":{"adjective":"Adjective","checkAnswer":"Check Answer","clearCanvas":"Clear Canvas"},"sayingGet":{"allSaying":"Below is the collection of quotes from Mark's Mailbox, you can also refer to it!","buttonContent":"Get Inspiration","opening":"Maybe there are some things in your heart that are currently unresolved, let the master give you a sentence. The occasional words may give you strength, think about the question and press the button."},"secret":{"career":"Career","content":"Content","disappear":"The trouble will disappear with the interaction box","feel":"Feel","female":"Female","friendship":"Friendship","gender":"Gender","male":"Male","mood":"Mood","nickname":"Nickname","other":"Other","relationship":"Love","someones":"Someone's","submit":"Submit","type":"Type","yours":"Yours"},"superstar":"Invincible Star","unlimitedYear":"Unlimited Year","weather":{"opening":"The current weather in Tianlong Kingdom where the master and mistress are located is","undefined":"Unknown"}}